/**
 * Причина завершения гипотезы
 * stop - модель закончила формировать гипотезу и вернула полный ответ
 * length - достигнут лимит токенов в сообщении
 * function_call - указывает, что при запросе была вызвана встроенная функция или сгенерированы аргументы для пользовательской функции
 * blacklist - запрос попадает под тематические ограничения
 * error - ответ модели содержит невалидные аргументы пользовательской функции
 */
export type FinishReason = 'stop' | 'length' | 'function_call' | 'blacklist' | 'error' | string;
